tutorials/rhoSimpleFoamFlamelets/KentHonnery/0/T
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions          [ 0 0 0 1 0 0 0 ];

internalField   uniform 290;

boundaryField
{
    inletfuel           
    {
        type  fixedValue;
 		value uniform 322;
    }

    inletair           
    {
        type  fixedValue;
 		value uniform 290;
    }

    outlet          
    {
        type  zeroGradient;
    }

    leftside       
    {
        type  zeroGradient;
    }

    burnerwall
    {
        type  zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
