tutorials/rhoSimpleFoamFlamelets/KentHonnery/0/csiv2
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          csiv2;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletfuel           
    {
	type fixedValue;
        value           uniform 0;
    }
    inletair           
    {
	type fixedValue;
        value           uniform 0;
    }

        outlet          
    {
        type            zeroGradient;
    }

    leftside       
    {
        type            zeroGradient;
    }

    burnerwall       
    {
        type            zeroGradient;
    }

    front    
    {
        type            wedge;
    }

    back    
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }

// ************************************************************************* //
