tutorials/rhoSimpleFoamFlamelets/KentHonnery/0/p
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions          [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 1e+5;

boundaryField
{
    inletfuel           
    {
        type            zeroGradient;
    }
    inletair           
    {
        type            zeroGradient;
    }

    outlet          
    {
        type            fixedValue;
        value           uniform 1e+5;
    }

    leftside       
    {
        type            zeroGradient;
    }

    burnerwall       
    {
        type            zeroGradient;
    }

    front    
    {
        type            wedge;
    }

    back   
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
