tutorials/rhoSimpleFoamFlamelets/KentHonnery/system/sampleDict

FoamFile
{
version 2.0;
format ascii;
class dictionary;
location "system";
object sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPointFace;

setFormat raw;

sets
(
location1
	{
		type midPoint;
		axis z;
		start (0.00003 0.00000 0.00);
		end   (0.00003 0.00000 0.86);
	}
);

surfaces ();

fields
(
	U
	k
	epsilon
	T
	csi
	csiv2
);


